{
    "minat":[
        {"id":1, "nama":"SOFTWARE", "detail":"Pilihan ini ditujukan untuk mahasiswa/i yang berminat untuk memasuki dunia pemrograman aplikasi perangkat lunak."},
        {"id":2, "nama":"EMBEDDED", "detail":"Pilihan ini ditujukan untuk mahasiswa/i yang berminat untuk memasuki dunia pengembangan sebuah alat atau sistem"},
        {"id":3, "nama":"JARINGAN", "detail":"Pilihan ini ditujukan untuk mahasiswa/i yang berminat untuk memasuki dunia jaringan"},
        {"id":4, "nama":"MULTIMEDIA", "detail":"Pilihan ini ditujukan untuk mahasiswa/i yang berminat untuk memasuki dunia media, layaknya 2D, 3D, grafis, dan video"}
    ],
    "berita":[
        {"id":1, "judul":"Basics of the Python Programming Environment", "gambar":"https://th.bing.com/th/id/OIP.f9-0w8rdG01Q_8KZfPrFWQHaD4?w=323&h=180&c=7&r=0&o=5&pid=1.7", "gambar2":"https://www.designnews.com/sites/cet.com/files/Tiobe-Report-Mar2021.png", "detail":"So, you want to learn more about Python. Thats a good decision for several reasons. First, the latest TIOBE Programming Community Index for March 2021 lists Python among the top three most popular languages. While C and Java continue to battle it out for first and second place (see Apr 2020 ratings), Python remains solidly in the third position. Even better news comes from the annual RedMonk Ranking report in which Python outranks JAVA to become the second most popular programming language. Over the last 5 years, Python has experienced growth of around 18-19 percent. The language ranks among the most popular in several other renowned platforms also such as Stack Overflow, Github, etc. \nOne of the appealing aspects of Python is its applications in technologies like AI & ML. But the reasonably high salary doesn't hurt. According to Indeed, the average Python developer salary in the US in 2021 is $110,840 per year (or $52.85 per hour). The salary amount has grown by 15% for the last 5 years. \nMany places offer training in Python, including Codeacademy, Udemy, Coursera, GitHub, MIT Open Courseware, and others - just to name a few. But before learning the structure, grammar, and methodology used in Python, it's best to appreciate how the language is used in a common space, e.g, the hardware that supports much of the Internet-of-Things (IoT)."},
        {"id":2, "judul":"Military Embedded Systems Global Market Report 2022: Scope for Software Innovation in Military Computers Presents Opportunities", "gambar":"https://th.bing.com/th/id/OIP.nXWKK56v14-CUHoBQ1nfYgHaE8?pid=ImgDet&rs=1", "gambar2":"https://s.yimg.com/ny/api/res/1.2/xRCYZu0XOc5E4OV9XELuEg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTQyMDtoPTI4MDtjZj13ZWJw/https://media.zenfs.com/en/globenewswire.com/ab638bf3afee1b00318ea536c224c20a", "detail":"The military embedded systems market is estimated to be USD 1.6 billion in 2022 and is projected to reach USD 2.5 billion by 2027, at a CAGR of 9.6% from 2022 to 2027. Growth of this market can be attributed to the rise in upgradation programmes by US military, development of advanced command & control systems, among others. The military embedded systems market is estimated to be USD 1.6 billion in 2022 and is projected to reach USD 2.5 billion by 2027, at a CAGR of 9.6% from 2022 to 2027. Growth of this market can be attributed to the rise in upgradation programmes by US military, development of advanced command & control systems, among others.\nThe graphical processing unit (GPU) is a component in an embedded system suitable for applications such as ISR and radar processing. The display technologies being used by the defense industry are becoming faster and require higher resolutions. They, therefore, require powerful GPUs to process images. Designers of HPEC (high-performance embedded computing) for defense have alternatives, such as FPGA (field-programmable gate array) or GPU when choosing a primary processor for image and signal processing.\nEmbedded testing is the checking of the functional as well as non-functional attributes of software and hardware in an embedded system. The purpose of embedded testing is to verify and validate the software and hardware as per the client's requirement. Embedded testing helps in finding bugs in software, cutting down development and maintenance costs, and improving system performance. Certification services are provided to ensure the products meet all required standards and to help identify specific areas for optimization. Customer prototype testing helps in identifying bugs and solving issues early in a product's development cycle. Several companies also offer on-site testing at their facilities. For instance, Smart Embedded Computing provides an on-site testing facility located in Tempe, Arizona (US), thus enabling local customers to save on shipping and travel costs."}
    ],
    "prestasi":[
        {"id":"2", "nama_lomba":"ISIF 2019 Turki", "juara":"Gold Medal", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2019/11/Mahasiswa-Tekkom-Undip-Mendapat-Medali-Emas-pada-Ajang-ISIF-2019-di-Turki.jpeg"},
        {"id":"3", "nama_lomba":"CNAC 2019", "juara":"Juara 2", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2019/10/prestasitekkom2019.jpeg"},
        {"id":"3", "nama_lomba":"APJC 2022", "juara":"Gold Medal", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2022/05/Screen-Shot-2022-05-30-at-11.03.02-e1653883520234-685x675.png"},
        {"id":"1", "nama_lomba":"GEMASTIK 2022", "juara":"Lolos PIMNAS", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2022/10/lolos-pimnas3.png"},
        {"id":"1", "nama_lomba":"GEMASTIK 2022", "juara":"Lolos PIMNAS", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2022/10/lolos-pimnas1.png"},
        {"id":"1", "nama_lomba":"GEMASTIK 2022", "juara":"Lolos PIMNAS", "gambar_lomba":"https://tekkom.ft.undip.ac.id/wp-content/uploads/2022/10/lolos-pimnas2.png"}
    ]
}
